# Data Input & Output

In [ ]:
# Read CSV file 
import pandas as pd

df = pd.read_csv("people-100.csv")
df

,Index,User Id,First Name,Last Name,Sex,Email,Phone,Date of birth,Job Title
0,1,88F7B33d2bcf9f5,Shelby,Terrell,Male,elijah57@example.net,001-084-906-7849x73518,1945-10-26,Games developer
1,2,f90cD3E76f1A9b9,Phillip,Summers,Female,bethany14@example.com,214.112.6044x4913,1910-03-24,Phytotherapist
2,3,DbeAb8CcdfeFC2c,Kristine,Travis,Male,bthompson@example.com,277.609.7938,1992-07-02,Homeopath
3,4,A31Bee3c201ef58,Yesenia,Martinez,Male,kaitlinkaiser@example.com,584.094.6111,2017-08-03,Market researcher
4,5,1bA7A3dc874da3c,Lori,Todd,Male,buchananmanuel@example.net,689-207-3558x7233,1938-12-01,Veterinary surgeon
...,...,...,...,...,...,...,...,...,...
95,96,5eFda7caAeB260E,Dennis,Barnes,Female,bmartin@example.org,001-095-524-2112x257,1954-07-30,Software engineer
96,97,CCbFce93d3720bE,Steve,Patterson,Female,latasha46@example.net,001-865-478-5157,1932-04-29,Barrister
97,98,2fEc528aFAF0b69,Wesley,Bray,Male,regina11@example.org,995-542-3004x76800,1994-12-28,Police officer
98,99,Adc7ad9B6e4A1Fe,Summer,Oconnell,Female,alexiscantrell@example.org,001-273-685-6932x092,2012-04-12,Broadcast journalist
99,100,b8D0aD3490FC7e1,Mariah,Bernard,Male,pcopeland@example.org,(341)594-6554x44657,2016-11-15,IT sales professional

In [2]:
# 1. Read specific columns
df = pd.read_csv("people-100.csv", usecols=['First Name','Email'])
df

   First Name                       Email
0      Shelby        elijah57@example.net
1     Phillip       bethany14@example.com
2    Kristine       bthompson@example.com
3     Yesenia   kaitlinkaiser@example.com
4        Lori  buchananmanuel@example.net
..        ...                         ...
95     Dennis         bmartin@example.org
96      Steve       latasha46@example.net
97     Wesley        regina11@example.org
98     Summer  alexiscantrell@example.org
99     Mariah       pcopeland@example.org

[100 rows x 2 columns]

In [5]:
# 2. Setting an Index Column
df = pd.read_csv("people-100.csv", index_col='First Name')
df

,Index,User Id,Last Name,Sex,Email,Phone,Date of birth,Job Title
First Name,,,,,,,,
Shelby,1,88F7B33d2bcf9f5,Terrell,Male,elijah57@example.net,001-084-906-7849x73518,1945-10-26,Games developer
Phillip,2,f90cD3E76f1A9b9,Summers,Female,bethany14@example.com,214.112.6044x4913,1910-03-24,Phytotherapist
Kristine,3,DbeAb8CcdfeFC2c,Travis,Male,bthompson@example.com,277.609.7938,1992-07-02,Homeopath
Yesenia,4,A31Bee3c201ef58,Martinez,Male,kaitlinkaiser@example.com,584.094.6111,2017-08-03,Market researcher
Lori,5,1bA7A3dc874da3c,Todd,Male,buchananmanuel@example.net,689-207-3558x7233,1938-12-01,Veterinary surgeon
...,...,...,...,...,...,...,...,...
Dennis,96,5eFda7caAeB260E,Barnes,Female,bmartin@example.org,001-095-524-2112x257,1954-07-30,Software engineer
Steve,97,CCbFce93d3720bE,Patterson,Female,latasha46@example.net,001-865-478-5157,1932-04-29,Barrister
Wesley,98,2fEc528aFAF0b69,Bray,Male,regina11@example.org,995-542-3004x76800,1994-12-28,Police officer
Summer,99,Adc7ad9B6e4A1Fe,Oconnell,Female,alexiscantrell@example.org,001-273-685-6932x092,2012-04-12,Broadcast journalist
Mariah,100,b8D0aD3490FC7e1,Bernard,Male,pcopeland@example.org,(341)594-6554x44657,2016-11-15,IT sales professional

In [6]:
# 3. Handling Missing Values
df = pd.read_csv("people-100.csv", na_values=['N/A',"Unknown"])
df

,Index,User Id,First Name,Last Name,Sex,Email,Phone,Date of birth,Job Title
0,1,88F7B33d2bcf9f5,Shelby,Terrell,Male,elijah57@example.net,001-084-906-7849x73518,1945-10-26,Games developer
1,2,f90cD3E76f1A9b9,Phillip,Summers,Female,bethany14@example.com,214.112.6044x4913,1910-03-24,Phytotherapist
2,3,DbeAb8CcdfeFC2c,Kristine,Travis,Male,bthompson@example.com,277.609.7938,1992-07-02,Homeopath
3,4,A31Bee3c201ef58,Yesenia,Martinez,Male,kaitlinkaiser@example.com,584.094.6111,2017-08-03,Market researcher
4,5,1bA7A3dc874da3c,Lori,Todd,Male,buchananmanuel@example.net,689-207-3558x7233,1938-12-01,Veterinary surgeon
...,...,...,...,...,...,...,...,...,...
95,96,5eFda7caAeB260E,Dennis,Barnes,Female,bmartin@example.org,001-095-524-2112x257,1954-07-30,Software engineer
96,97,CCbFce93d3720bE,Steve,Patterson,Female,latasha46@example.net,001-865-478-5157,1932-04-29,Barrister
97,98,2fEc528aFAF0b69,Wesley,Bray,Male,regina11@example.org,995-542-3004x76800,1994-12-28,Police officer
98,99,Adc7ad9B6e4A1Fe,Summer,Oconnell,Female,alexiscantrell@example.org,001-273-685-6932x092,2012-04-12,Broadcast journalist
99,100,b8D0aD3490FC7e1,Mariah,Bernard,Male,pcopeland@example.org,(341)594-6554x44657,2016-11-15,IT sales professional

In [7]:
# 4. Reading Csv file with Different Delimiters

data = """order_id,product_price, customer_city:payment_method, order_date, quantity
1001, 29.99:Phone|Credit, New York, 2025-01-15, 2
1002, 15.49, Laptop, Debit|Chicago:2025-01-16, 1
1003:89.99, Headphones, Cash, Miami:2025-01-16, 3
1004, 199.99|TV, Credit, Los Angeles, 2025-01-17, 1
1005:9.99, Mouse|Debit, Seattle, 2025-01-17, 5
1006, 49.99, Keyboard, Credit|Houston:2025-01-18, 2"""

with open("orders.csv","w") as file:
    file.write(data)

print(data)

order_id,product_price, customer_city:payment_method, order_date, quantity
1001, 29.99:Phone|Credit, New York, 2025-01-15, 2
1002, 15.49, Laptop, Debit|Chicago:2025-01-16, 1
1003:89.99, Headphones, Cash, Miami:2025-01-16, 3
1004, 199.99|TV, Credit, Los Angeles, 2025-01-17, 1
1005:9.99, Mouse|Debit, Seattle, 2025-01-17, 5
1006, 49.99, Keyboard, Credit|Houston:2025-01-18, 2

In [ ]:
# 5. Using nrows in read_csv()
df = pd.read_csv('orders.csv', sep='[:, |_]', engine='python')
df

,order,id,product,price,Unnamed: 4,customer,city,payment,method,Unnamed: 9,order.1,date,Unnamed: 12,quantity
0,1001,NaN,29.99,Phone,Credit,NaN,New,York,NaN,2025-01-15,NaN,2.0,NaN,NaN
1,1002,NaN,15.49,NaN,Laptop,NaN,Debit,Chicago,2025-01-16,NaN,1,NaN,NaN,NaN
2,1003,89.99,NaN,Headphones,NaN,Cash,NaN,Miami,2025-01-16,NaN,3,NaN,NaN,NaN
3,1004,NaN,199.99,TV,NaN,Credit,NaN,Los,Angeles,NaN,2025-01-17,NaN,1.0,NaN
4,1005,9.99,NaN,Mouse,Debit,NaN,Seattle,NaN,2025-01-17,NaN,5,NaN,NaN,NaN
5,1006,NaN,49.99,NaN,Keyboard,NaN,Credit,Houston,2025-01-18,NaN,2,NaN,NaN,NaN

In [ ]:
# 6. Using Skiprows
df = pd.read_csv("people-100.csv")
print("Previous Dataset: ")
print(df)

df = pd.read_csv("people-100.csv", skiprows=[4,5])
print("Dataset After skipping rows: ")

Previous Dataset:
    Index          User Id First Name  Last Name     Sex  \
0       1  88F7B33d2bcf9f5     Shelby    Terrell    Male
1       2  f90cD3E76f1A9b9    Phillip    Summers  Female
2       3  DbeAb8CcdfeFC2c   Kristine     Travis    Male
3       4  A31Bee3c201ef58    Yesenia   Martinez    Male
4       5  1bA7A3dc874da3c       Lori       Todd    Male
..    ...              ...        ...        ...     ...
95     96  5eFda7caAeB260E     Dennis     Barnes  Female
96     97  CCbFce93d3720bE      Steve  Patterson  Female
97     98  2fEc528aFAF0b69     Wesley       Bray    Male
98     99  Adc7ad9B6e4A1Fe     Summer   Oconnell  Female
99    100  b8D0aD3490FC7e1     Mariah    Bernard    Male

                         Email                   Phone Date of birth  \
0         elijah57@example.net  001-084-906-7849x73518    1945-10-26
1        bethany14@example.com       214.112.6044x4913    1910-03-24
2        bthompson@example.com            277.609.7938    1992-07-02
3    kaitlinkaiser@example.com            584.094.6111    2017-08-03
4   buchananmanuel@example.net       689-207-3558x7233    1938-12-01
..                         ...                     ...           ...
95         bmartin@example.org    001-095-524-2112x257    1954-07-30
96       latasha46@example.net        001-865-478-5157    1932-04-29
97        regina11@example.org      995-542-3004x76800    1994-12-28
98  alexiscantrell@example.org    001-273-685-6932x092    2012-04-12
99       pcopeland@example.org     (341)594-6554x44657    2016-11-15

                Job Title
0         Games developer
1          Phytotherapist
2               Homeopath
3       Market researcher
4      Veterinary surgeon
..                    ...
95      Software engineer
96              Barrister
97         Police officer
98   Broadcast journalist
99  IT sales professional

[100 rows x 9 columns]
Dataset After skipping rows:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 98 entries, 0 to 97
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Index          98 non-null     int64
 1   User Id        98 non-null     object
 2   First Name     98 non-null     object
 3   Last Name      98 non-null     object
 4   Sex            98 non-null     object
 5   Email          98 non-null     object
 6   Phone          98 non-null     object
 7   Date of birth  98 non-null     object
 8   Job Title      98 non-null     object
dtypes: int64(1), object(8)
memory usage: 7.0+ KB
None

In [8]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 98 entries, 0 to 97
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Index          98 non-null     int64
 1   User Id        98 non-null     object
 2   First Name     98 non-null     object
 3   Last Name      98 non-null     object
 4   Sex            98 non-null     object
 5   Email          98 non-null     object
 6   Phone          98 non-null     object
 7   Date of birth  98 non-null     object
 8   Job Title      98 non-null     object
dtypes: int64(1), object(8)
memory usage: 7.0+ KB
None

In [6]:
# 7. Parsing Date (parse_date)
df = pd.read_csv("people-100.csv", parse_dates=['Date of birth'])
print(df.info())
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Index          100 non-null    int64
 1   User Id        100 non-null    object
 2   First Name     100 non-null    object
 3   Last Name      100 non-null    object
 4   Sex            100 non-null    object
 5   Email          100 non-null    object
 6   Phone          100 non-null    object
 7   Date of birth  100 non-null    datetime64[ns]
 8   Job Title      100 non-null    object
dtypes: datetime64[ns](1), int64(1), object(7)
memory usage: 7.2+ KB
None

,Index,User Id,First Name,Last Name,Sex,Email,Phone,Date of birth,Job Title
0,1,88F7B33d2bcf9f5,Shelby,Terrell,Male,elijah57@example.net,001-084-906-7849x73518,1945-10-26,Games developer
1,2,f90cD3E76f1A9b9,Phillip,Summers,Female,bethany14@example.com,214.112.6044x4913,1910-03-24,Phytotherapist
2,3,DbeAb8CcdfeFC2c,Kristine,Travis,Male,bthompson@example.com,277.609.7938,1992-07-02,Homeopath
3,4,A31Bee3c201ef58,Yesenia,Martinez,Male,kaitlinkaiser@example.com,584.094.6111,2017-08-03,Market researcher
4,5,1bA7A3dc874da3c,Lori,Todd,Male,buchananmanuel@example.net,689-207-3558x7233,1938-12-01,Veterinary surgeon
...,...,...,...,...,...,...,...,...,...
95,96,5eFda7caAeB260E,Dennis,Barnes,Female,bmartin@example.org,001-095-524-2112x257,1954-07-30,Software engineer
96,97,CCbFce93d3720bE,Steve,Patterson,Female,latasha46@example.net,001-865-478-5157,1932-04-29,Barrister
97,98,2fEc528aFAF0b69,Wesley,Bray,Male,regina11@example.org,995-542-3004x76800,1994-12-28,Police officer
98,99,Adc7ad9B6e4A1Fe,Summer,Oconnell,Female,alexiscantrell@example.org,001-273-685-6932x092,2012-04-12,Broadcast journalist
99,100,b8D0aD3490FC7e1,Mariah,Bernard,Male,pcopeland@example.org,(341)594-6554x44657,2016-11-15,IT sales professional

In [9]:
# loading a csv data from a URL
url = "https://drive.google.com/uc?id=1OT84-j5J5z2tHoUvikJtoJFInWmlyYzY&export=download"
df = pd.read_csv(url)
df

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
0,1,dE014d010c7ab0c,Andrew,Goodman,Stewart-Flynn,Rowlandberg,Macao,846-790-4623x4715,(422)787-2331x71127,marieyates@gomez-spencer.info,2021-07-26,http://www.shea.biz/
1,2,2B54172c8b65eC3,Alvin,Lane,"Terry, Proctor and Lawrence",Bethside,Papua New Guinea,124-597-8652x05682,321.441.0588x6218,alexandra86@mccoy.com,2021-06-24,http://www.pena-cole.com/
2,3,d794Dd48988d2ac,Jenna,Harding,Bailey Group,Moniquemouth,China,(335)987-3085x3780,001-680-204-8312,justincurtis@pierce.org,2020-04-05,http://www.booth-reese.biz/
3,4,3b3Aa4aCc68f3Be,Fernando,Ford,Moss-Maxwell,Leeborough,Macao,(047)752-3122,048.779.5035x9122,adeleon@hubbard.org,2020-11-29,http://www.hebert.com/
4,5,D60df62ad2ae41E,Kara,Woods,Mccarthy-Kelley,Port Jacksonland,Nepal,+1-360-693-4419x19272,163-627-2565,jesus90@roberson.info,2022-04-22,http://merritt.com/
...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,FbcCaF483aFaFAE,Diana,Monroe,Bass-Wilson,Lake Jacksonmouth,Guatemala,+1-171-715-9766x54993,(489)413-7296x32807,cassidymercado@bonilla.com,2022-01-09,http://castro.net/
996,997,979c4D58Ae9a9cc,Jerry,Morales,Pratt-King,South Dominiquemouth,Georgia,132.253.8501x097,+1-301-292-8363x80270,gavin13@logan-downs.com,2021-08-21,https://www.braun.info/
997,998,D0DcF6a4BcefCc8,Tracie,Floyd,"Holt, Wilson and Shields",East Chloeshire,Solomon Islands,1193982387,(482)926-8966,lowehailey@oconnor.org,2020-04-22,http://www.zavala-rubio.com/
998,999,90EE9CbbDa374E9,Paul,Barnes,"Brown, Oliver and Haynes",South Shane,Finland,+1-537-466-3245x3699,791-835-9075,hodgeseddie@hardin-wells.com,2021-03-12,https://stone-randolph.info/
999,1000,51732B5b2328015,Dominic,Duran,Durham LLC,East Wendy,British Indian Ocean Territory (Chagos Archipe...,+1-278-758-4331,814-860-0941x057,owarner@velasquez.info,2021-12-09,http://www.cox.com/

## Writting data to CSV file

In [3]:
# importing pandas as pd
import pandas as pd

# list of name, degree, score
nme = ["Ashish","Pankaj","Sudhir","Priya"]
deg = ["MBA","MCA","M.TECH","B.TECH"]
scr = [90, 40, 80, 98]

# dictionary of lists
dict = {'name': nme, 'degree': deg, 'score': scr}

df = pd.DataFrame(dict)

In [4]:
df.to_csv('file1.csv')

In [5]:
# saving csv without header and Index
df.to_csv('file2.csv', header=False, index=False)

In [6]:
# csv file using tab sep
df.to_csv('file3.csv', sep='\t', index=False, header=True)

In [8]:
new_df = pd.read_csv('file3.csv')
new_df

  name\tdegree\tscore
0     Ashish\tMBA\t90
1     Pankaj\tMCA\t40
2  Sudhir\tM.TECH\t80
3   Priya\tB.TECH\t98

In [ ]:
# installation package for read excel file
pip install openpyxl

Defaulting to user installation because normal site-packages is not writeable
Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 2/2 [openpyxl]1/2 [openpyxl]
Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5
Note: you may need to restart the kernel to use updated packages.

In [11]:
## Read a Excel File

df = pd.read_excel('SaleData.xlsx')
df

,OrderDate,Region,Manager,SalesMan,Item,Units,Unit_price,Sale_amt
0,2018-01-06,East,Martha,Alexander,Television,95.00,1198.000,113810.00
1,2018-01-23,Central,Hermann,Shelli,Home Theater,50.00,500.000,25000.00
2,2018-02-09,Central,Hermann,Luis,Television,36.00,1198.000,43128.00
3,2018-02-26,Central,Timothy,David,Cell Phone,27.00,225.000,6075.00
4,2018-03-15,West,Timothy,Stephen,Television,56.00,1198.000,67088.00
5,2018-04-01,East,Martha,Alexander,Home Theater,60.00,500.000,30000.00
6,2018-04-18,Central,Martha,Steven,Television,75.00,1198.000,89850.00
7,2018-05-05,Central,Hermann,Luis,Television,90.00,1198.000,107820.00
8,2018-05-22,West,Douglas,Michael,Television,32.00,1198.000,38336.00
9,2018-06-08,East,Martha,Alexander,Home Theater,60.00,500.000,30000.00
10,2018-06-25,Central,Hermann,Sigal,Television,90.00,1198.000,107820.00
11,2018-07-12,East,Martha,Diana,Home Theater,29.00,500.000,14500.00
12,2018-07-29,East,Douglas,Karen,Home Theater,81.00,500.000,40500.00
13,2018-08-15,East,Martha,Alexander,Television,35.00,1198.000,41930.00
14,2018-09-01,Central,Douglas,John,Desk,2.00,125.000,250.00
15,2018-09-18,East,Martha,Alexander,Video Games,16.00,58.500,936.00
16,2018-10-05,Central,Hermann,Sigal,Home Theater,28.00,500.000,14000.00
17,2018-10-22,East,Martha,Alexander,Cell Phone,64.00,225.000,14400.00
18,2018-11-08,East,Douglas,Karen,Cell Phone,15.00,225.000,3375.00
19,2018-11-25,Central,Hermann,Shelli,Video Games,96.00,58.500,5616.00
20,2018-12-12,Central,Douglas,John,Television,67.00,1198.000,80266.00
21,2018-12-29,East,Douglas,Karen,Video Games,74.00,58.500,4329.00
22,2019-01-15,Central,Timothy,David,Home Theater,46.00,500.000,23000.00
23,2019-02-01,Central,Douglas,John,Home Theater,87.00,500.000,43500.00
24,2019-02-18,East,Martha,Alexander,Home Theater,4.00,500.000,2000.00
25,2019-03-07,West,Timothy,Stephen,Home Theater,7.00,500.000,3500.00
26,2019-03-24,Central,Hermann,Luis,Video Games,50.00,58.500,2925.00
27,2019-04-10,Central,Martha,Steven,Television,66.00,1198.000,79068.00
28,2019-04-27,East,Martha,Diana,Cell Phone,96.00,225.000,21600.00
29,2019-05-14,Central,Timothy,David,Television,53.00,1198.000,63494.00
30,2019-05-31,Central,Timothy,David,Home Theater,80.00,500.000,40000.00
31,2019-06-17,Central,Hermann,Shelli,Desk,5.00,125.000,625.00
32,2019-07-04,East,Martha,Alexander,Video Games,62.00,58.500,3627.00
33,2019-07-21,Central,Hermann,Sigal,Video Games,55.00,58.500,3217.50
34,2019-08-07,Central,Hermann,Shelli,Video Games,42.00,58.500,2457.00
35,2019-08-24,West,Timothy,Stephen,Desk,3.00,125.000,375.00
36,2019-09-10,Central,Timothy,David,Television,7.00,1198.000,8386.00
37,2019-09-27,West,Timothy,Stephen,Cell Phone,76.00,225.000,17100.00
38,2019-10-14,West,Douglas,Michael,Home Theater,57.00,500.000,28500.00
39,2019-10-31,Central,Martha,Steven,Television,14.00,1198.000,16772.00
40,2019-11-17,Central,Hermann,Luis,Home Theater,11.00,500.000,5500.00
41,2019-12-04,Central,Hermann,Luis,Home Theater,94.00,500.000,47000.00
42,2019-12-21,Central,Martha,Steven,Home Theater,28.00,500.000,14000.00
43,NaT,NaN,NaN,NaN,NaN,278.00,1125.000,62550.00
44,NaT,NaN,NaN,NaN,NaN,34.75,140.625,7818.75

In [15]:
df = pd.read_excel('SaleData.xlsx', sheet_name='Sales Data')
df

,OrderDate,Region,Manager,SalesMan,Item,Units,Unit_price,Sale_amt
0,2018-01-06,East,Martha,Alexander,Television,95.00,1198.000,113810.00
1,2018-01-23,Central,Hermann,Shelli,Home Theater,50.00,500.000,25000.00
2,2018-02-09,Central,Hermann,Luis,Television,36.00,1198.000,43128.00
3,2018-02-26,Central,Timothy,David,Cell Phone,27.00,225.000,6075.00
4,2018-03-15,West,Timothy,Stephen,Television,56.00,1198.000,67088.00
5,2018-04-01,East,Martha,Alexander,Home Theater,60.00,500.000,30000.00
6,2018-04-18,Central,Martha,Steven,Television,75.00,1198.000,89850.00
7,2018-05-05,Central,Hermann,Luis,Television,90.00,1198.000,107820.00
8,2018-05-22,West,Douglas,Michael,Television,32.00,1198.000,38336.00
9,2018-06-08,East,Martha,Alexander,Home Theater,60.00,500.000,30000.00
10,2018-06-25,Central,Hermann,Sigal,Television,90.00,1198.000,107820.00
11,2018-07-12,East,Martha,Diana,Home Theater,29.00,500.000,14500.00
12,2018-07-29,East,Douglas,Karen,Home Theater,81.00,500.000,40500.00
13,2018-08-15,East,Martha,Alexander,Television,35.00,1198.000,41930.00
14,2018-09-01,Central,Douglas,John,Desk,2.00,125.000,250.00
15,2018-09-18,East,Martha,Alexander,Video Games,16.00,58.500,936.00
16,2018-10-05,Central,Hermann,Sigal,Home Theater,28.00,500.000,14000.00
17,2018-10-22,East,Martha,Alexander,Cell Phone,64.00,225.000,14400.00
18,2018-11-08,East,Douglas,Karen,Cell Phone,15.00,225.000,3375.00
19,2018-11-25,Central,Hermann,Shelli,Video Games,96.00,58.500,5616.00
20,2018-12-12,Central,Douglas,John,Television,67.00,1198.000,80266.00
21,2018-12-29,East,Douglas,Karen,Video Games,74.00,58.500,4329.00
22,2019-01-15,Central,Timothy,David,Home Theater,46.00,500.000,23000.00
23,2019-02-01,Central,Douglas,John,Home Theater,87.00,500.000,43500.00
24,2019-02-18,East,Martha,Alexander,Home Theater,4.00,500.000,2000.00
25,2019-03-07,West,Timothy,Stephen,Home Theater,7.00,500.000,3500.00
26,2019-03-24,Central,Hermann,Luis,Video Games,50.00,58.500,2925.00
27,2019-04-10,Central,Martha,Steven,Television,66.00,1198.000,79068.00
28,2019-04-27,East,Martha,Diana,Cell Phone,96.00,225.000,21600.00
29,2019-05-14,Central,Timothy,David,Television,53.00,1198.000,63494.00
30,2019-05-31,Central,Timothy,David,Home Theater,80.00,500.000,40000.00
31,2019-06-17,Central,Hermann,Shelli,Desk,5.00,125.000,625.00
32,2019-07-04,East,Martha,Alexander,Video Games,62.00,58.500,3627.00
33,2019-07-21,Central,Hermann,Sigal,Video Games,55.00,58.500,3217.50
34,2019-08-07,Central,Hermann,Shelli,Video Games,42.00,58.500,2457.00
35,2019-08-24,West,Timothy,Stephen,Desk,3.00,125.000,375.00
36,2019-09-10,Central,Timothy,David,Television,7.00,1198.000,8386.00
37,2019-09-27,West,Timothy,Stephen,Cell Phone,76.00,225.000,17100.00
38,2019-10-14,West,Douglas,Michael,Home Theater,57.00,500.000,28500.00
39,2019-10-31,Central,Martha,Steven,Television,14.00,1198.000,16772.00
40,2019-11-17,Central,Hermann,Luis,Home Theater,11.00,500.000,5500.00
41,2019-12-04,Central,Hermann,Luis,Home Theater,94.00,500.000,47000.00
42,2019-12-21,Central,Martha,Steven,Home Theater,28.00,500.000,14000.00
43,NaT,NaN,NaN,NaN,NaN,278.00,1125.000,62550.00
44,NaT,NaN,NaN,NaN,NaN,34.75,140.625,7818.75

## Read JSON File

In [ ]:
# 1. read json
df = pd.read_json('data.json')
df

   id    name  age
0   1   Aarav   28
1   2   Priya   24
2   3  Vikram   32
3   4  Ananya   19
4   5   Rahul   27
5   6   Sanya   23
6   7   Arjun   30
7   8    Neha   26
8   9   Rohan   34
9  10  Kavita   21

In [18]:
# 2 normalize() method
import json

data = {"One": {"0": 60, "1": 60, "2": 60, "3": 45, "4": 45, "5": 60},
        "Two": {"0": 110, "1": 117, "2": 103, "3": 109, "4": 117, "5": 102}}

json_data = json.dumps(data)

df_normalize = pd.json_normalize(json.loads(json_data))
print("\n DataFrame using JSON module and normalized() method: ")
df_normalize

 DataFrame using JSON module and normalized() method:

,One.0,One.1,One.2,One.3,One.4,One.5,Two.0,Two.1,Two.2,Two.3,Two.4,Two.5
0,60,60,60,45,45,60,110,117,103,109,117,102

## Parsing JSON Dataset

In [19]:
df = pd.DataFrame([['a','b'],['c','d']],
                  index=['row 1', 'row 2'],
                  columns=['col 1', 'col 2'])
df

      col 1 col 2
row 1     a     b
row 2     c     d

In [21]:
print(df.to_json(orient='split'))
print(df.to_json(orient='index'))

{"columns":["col 1","col 2"],"index":["row 1","row 2"],"data":[["a","b"],["c","d"]]}
{"row 1":{"col 1":"a","col 2":"b"},"row 2":{"col 1":"c","col 2":"d"}}

In [25]:
## Read the Json file directly from web data

# pip install requests

import requests

url = 'https://jsonplaceholder.typicode.com/posts'
response = requests.get(url)

data = pd.json_normalize(response.json())
data

/Users/awanishraj/Library/Python/3.9/lib/python/site-packages/urllib3/__init__.py:35: NotOpenSSLWarning: urllib3 v2 only supports OpenSSL 1.1.1+, currently the 'ssl' module is compiled with 'LibreSSL 2.8.3'. See: https://github.com/urllib3/urllib3/issues/3020
  warnings.warn(

,userId,id,title,body
0,1,1,sunt aut facere repellat provident occaecati e...,quia et suscipit\nsuscipit recusandae consequu...
1,1,2,qui est esse,est rerum tempore vitae\nsequi sint nihil repr...
2,1,3,ea molestias quasi exercitationem repellat qui...,et iusto sed quo iure\nvoluptatem occaecati om...
3,1,4,eum et est occaecati,ullam et saepe reiciendis voluptatem adipisci\...
4,1,5,nesciunt quas odio,repudiandae veniam quaerat sunt sed\nalias aut...
...,...,...,...,...
95,10,96,quaerat velit veniam amet cupiditate aut numqu...,in non odio excepturi sint eum\nlabore volupta...
96,10,97,quas fugiat ut perspiciatis vero provident,eum non blanditiis soluta porro quibusdam volu...
97,10,98,laboriosam dolor voluptates,doloremque ex facilis sit sint culpa\nsoluta a...
98,10,99,temporibus sit alias delectus eligendi possimu...,quo deleniti praesentium dicta non quod\naut e...
99,10,100,at nam consequatur ea labore ea harum,cupiditate quo est a modi nesciunt soluta\nips...

In [28]:
# Handling Nested Json in pandas
import json
from pandas import json_normalize

sample_json = {
    "organizations": [
        {
            "org_id": 1,
            "name": "Bharatiya Kala Kendra",
            "city": "Delhi",
            "events": [
                {"event_id": 101, "title": "Kathak Dance Recital", "date": "2025-07-15", "duration_hours": 2},
                {"event_id": 102, "title": "Hindustani Classical Concert", "date": "2025-08-10", "duration_hours": 3}
            ]
        },
        {
            "org_id": 2,
            "name": "Nritya Academy",
            "city": "Mumbai",
            "events": [
                {"event_id": 201, "title": "Bharatanatyam Performance", "date": "2025-06-20", "duration_hours": 2.5},
                {"event_id": 202, "title": "Odissi Workshop", "date": "2025-09-05", "duration_hours": 4}
            ]
        },
        {
            "org_id": 3,
            "name": "Sangeet Natak Akademi",
            "city": "Chennai",
            "events": [
                {"event_id": 301, "title": "Carnatic Music Festival", "date": "2025-10-12", "duration_hours": 5}
            ]
        }
    ]
}

# save to file
with open("indian_cultural_events.json",'w') as f:
    json.dump(sample_json, f, indent=2)

# load the Json File
with open('indian_cultural_events.json','r') as f:
    d = json.load(f)

# Normalize the 'events' data
events_df = json_normalize(d['organizations'], record_path='events', meta=['org_id','name','city'])
events_df

,event_id,title,date,duration_hours,org_id,name,city
0,101,Kathak Dance Recital,2025-07-15,2.0,1,Bharatiya Kala Kendra,Delhi
1,102,Hindustani Classical Concert,2025-08-10,3.0,1,Bharatiya Kala Kendra,Delhi
2,201,Bharatanatyam Performance,2025-06-20,2.5,2,Nritya Academy,Mumbai
3,202,Odissi Workshop,2025-09-05,4.0,2,Nritya Academy,Mumbai
4,301,Carnatic Music Festival,2025-10-12,5.0,3,Sangeet Natak Akademi,Chennai

In [29]:
# JSON Orientations in pandas
data = {
    'event_id': [101,102,201],
    'title': ['Kathak Recital', 'Classical Concert', 'Bharatanatyam Show'],
    'duration_hours': [2.0, 3.0,2.5]
}

df = pd.DataFrame(data, index=['E1','E2','E3'])
print("Original DataFrame: ")
df

Original DataFrame:

    event_id               title  duration_hours
E1       101      Kathak Recital             2.0
E2       102   Classical Concert             3.0
E3       201  Bharatanatyam Show             2.5

In [30]:
df.to_json('events_records.json', orient='records', lines=True)
df

    event_id               title  duration_hours
E1       101      Kathak Recital             2.0
E2       102   Classical Concert             3.0
E3       201  Bharatanatyam Show             2.5

In [ ]:
df_records = pd.read_json('events_records.json', orient='orients', lines=True)

with open('events_records.json','r') as f:
    print("JSON Records: ")
    print(f.read())

print("\nDataFrame from records: ")
print(df_records)

JSON Records:
{"event_id":101,"title":"Kathak Recital","duration_hours":2.0}
{"event_id":102,"title":"Classical Concert","duration_hours":3.0}
{"event_id":201,"title":"Bharatanatyam Show","duration_hours":2.5}


DataFrame from records:
   event_id               title  duration_hours
0       101      Kathak Recital             2.0
1       102   Classical Concert             3.0
2       201  Bharatanatyam Show             2.5